Revit 2027 API
ExternallyTaggedNonBReps Methods
The ExternallyTaggedNonBReps type exposes the following members.
Methods
Name | Description
Add |  Adds a copy of the input ExternallyTaggedNonBRep to this collection.
CanAddExternallyTaggedNonBRep |  Checks if the input geometry could be added to this collection or not.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace